//เลข
const setOne = new Set([...'กดภถฤทุ่าำaAjJqQiIyY1']);
const setTwo = new Set([...'ขชบปงูเแ้bBkKrR2']);
const setThree = new Set([...'ฆฒต๋ฑๆcClLsSgG3']);
const setFour = new Set([...'คธรญษโะิัdDmMtT4']);
const setFive = new Set([...'ฉณฌนมฎหฬฮึeEnNxXhH5']);
const setSix = new Set([...'วอจลใwWuUvV6']);
const setSeven = new Set([...'ศสซีื๊oOzZ7']);
const setEight = new Set([...'ยพฟผฝ็fFpP8']);
const setNine = new Set([...'ฏฐไ์9']);

export const textToNum = (text: string, callback?: (num: number) => void) => {
    let num = 0;
    for (let i = 0; i < text.length; i++) {
        num += setOne.has(text[i]) ? 1 : 0;
        num += setTwo.has(text[i]) ? 2 : 0;
        num += setThree.has(text[i]) ? 3 : 0;
        num += setFour.has(text[i]) ? 4 : 0;
        num += setFive.has(text[i]) ? 5 : 0;
        num += setSix.has(text[i]) ? 6 : 0;
        num += setSeven.has(text[i]) ? 7 : 0;
        num += setEight.has(text[i]) ? 8 : 0;
        num += setNine.has(text[i]) ? 9 : 0;
    }
    callback?.(num);
    return num;
};

//ทักษา
const set_1 = new Set([...'ะาิีึืุูเแไใำโ']);
const set_2 = new Set([...'กขคฆง']);
const set_3 = new Set([...'จฉชซญฌ']);
const set_4 = new Set([...'ฎฏฐฑฒณ']);
const set_5 = new Set([...'ดตถทธน']);
const set_6 = new Set([...'บปผฝพฟภม']);
const set_7 = new Set([...'ยรลว']);
const set_8 = new Set([...'ศษสหฬฮ']);

//6.00 - 17.59   พ กลางวัน
//18.00 - 23.59  พ กลางคืน
//0.00 - 5.59

export const TransToHoroDate = (date: Date) => {
    const dayInfo = [
        'อาทิตย์',
        'จันทร์',
        'อังคาร',
        'พุธ',
        'พฤหัสบดี',
        'ศุกร์',
        'เสาร์',
        'พุธกลางคืน',
    ];
    const dayInfoId = {
        อาทิตย์: 1,
        จันทร์: 2,
        อังคาร: 3,
        พุธ: 4,
        พฤหัสบดี: 6,
        ศุกร์: 8,
        เสาร์: 5,
        พุธกลางคืน: 7,
    };
    const day = date.getDay();
    const hour = date.getHours();

    let horoDate = new Date(date);
    let horoDay = day;

    // If the time is between 00:00 and 05:59, set horoDate to the previous day
    if (hour >= 0 && hour < 6) {
        horoDate.setDate(horoDate.getDate() - 1);
        horoDay = (horoDay - 1 + 7) % 7;
    }

    // Handle the special case for Wednesday night
    if ((day === 3 && hour >= 18) || (day === 4 && hour < 6)) {
        horoDay = 7; // Special case for Wednesday night
    }

    const formattedDate = `${horoDate.getDate()}  ${horoDate.toLocaleString(
        'th-TH',
        { month: 'short' }
    )} ${horoDate.getFullYear()}`;

    return {
        day: dayInfo[horoDay],
        dayId: dayInfoId[dayInfo[horoDay] as keyof typeof dayInfoId],
        date: formattedDate,
    };
};

function calcPosition(arrPos: string[], text: string) {
    let inputArr = [...text];
    let transToPos: string[] = [];

    inputArr.forEach((val, i) => {
        if (set_2.has(val)) {
            transToPos.push(arrPos[1]);
        } else if (set_3.has(val)) {
            transToPos.push(arrPos[2]);
        } else if (set_4.has(val)) {
            transToPos.push(arrPos[3]);
        } else if (set_5.has(val)) {
            transToPos.push(arrPos[4]);
        } else if (set_6.has(val)) {
            transToPos.push(arrPos[5]);
        } else if (set_7.has(val)) {
            transToPos.push(arrPos[6]);
        } else if (set_8.has(val)) {
            transToPos.push(arrPos[7]);
        } else if (set_1.has(val)) {
            transToPos.push(arrPos[0]);
        } else {
            transToPos.push(' ');
        }
    });
    return transToPos;
}
export function calcHoro(text: string, dayNum: number) {
    let genArr = [
        'บริวาร',
        'อายุ',
        'เดช',
        'ศรี',
        'มูละ',
        'อุสาหะ',
        'มนตรี',
        'กาลี',
    ];
    for (let i = 1; i < dayNum; i++) {
        genArr.unshift(genArr.pop()!);
    }
    const getTransToPos = calcPosition(genArr, text);
    return getTransToPos;
}

export const numberMeaning = [
    {
        number: 1,
        meaning:
            'หมายถึง พระอาทิตย์ เป็นเลขที่ดี มั่นคง มีลักษณะครอบงํา มักชอบเป็นใหญ่ ไม่ยอมเป็นรองใคร หยิ่ง ถือตัว ทำให้ใฝ่ทะเยอทะยานที่จะเป็นใหญ่ ชอบใช้ความคิดเห็นของตนเองเหนือผู้อื่น มีข้อคิดเห็นเฉียบขาด ใจคอมั่นคงไม่รวนเร มีบริวารมาก ไปที่ไหนทำตัวเด่น ชอบเป็นหัวหน้า เป็นผู้นำ เป็นเลขที่สำคัญ เพราะเลขดาวอาทิตย์เป็นประธานของดาวพระเคราะห์ทั้งมวลในจักรวาล',
        rate: 'great',
    },
    {
        number: 2,
        meaning:
            'หมายถึง ดาวจันทร์ เป็นธาตุน้ำ บุคคลใต้อิทธิพลเลข 2 นี้อ่อนไหวง่าย เป็นคนคิดฝัน มักมีจินตนาการสูง ชอบความละเอียดอ่อน จึงมีส่วนโน้มเอียงไปทางสตรีเพศ คล้อยตามเสียงส่วนใหญ่ มีจุดมุ่งหมาย แต่ยังไม่ต้องการในทันที ชอบอิสระเสรี ควบคุมสติอารมณ์ได้ดีมาก เหมาะเป็นนักแสดง นักพูด ชอบงานที่อยู่เบื้องหลังมากกว่าออกหน้า แต่ดื้อรั้น มักเอาแต่ใจตัวเองพอ ๆ กับเลข 1',
        rate: 'good',
    },
    {
        number: 3,
        meaning:
            'หมายถึง ดาวอังคาร เป็นเลขร้ายตามหลักโหราศาสตร์ ดาวบาปเคราะห์เป็นตัวคราส บ่งถึงการจู่โจมทะลุทะลวง ดาวอังคารเป็นดาวสร้างความปั่นป่วน เช่นการทะเลาะวิวาท สงคราม บ่งถึงการขัดแย้งอย่างรุนแรง การใช้อาวุธ ดาวอังคารถือเป็นดาวกล้า ขยัน เปิดเผย แต่ทว่า บุคคลเลข 3 มักมีโทสจริต อ่อนไหวจัด มักมีอุบัติเหตุ ผ่าตัด',
        rate: 'bad',
    },
    {
        number: 4,
        meaning:
            'หมายถึง ดาวพุธ เป็นตัวแทนแห่งมันสมอง ปฏิภาณ ความเฉลียวฉลาดในการเจรจาติดต่อสื่อสาร การคบหาสมาคม เป็นดาวที่มีความกลมกลืนในสิ่งต่างๆ ได้ง่าย จึงมักเรียกว่าดาวรวนเร เป็นเลขที่ดีมากสำหรับการเจรจา การพูด เข้ากับใครก็ได้ง่าย เป็นดาวธาตุดิน คู่มิตรกับเลข 2 และเลข 8',
        rate: 'good',
    },
    {
        number: 5,
        meaning:
            'หมายถึง ดาวพฤหัส เป็นดาวประธานสุภเคราะห์ ดาวผู้ดี ดาวดี ดาวคุณธรรม มีความอำนวยความสำเร็จให้ทุกคนที่อยู่ภายใต้เลข 5 เป็นเลขแห่งความอุดมสมบูรณ์ การศึกษา การใฝ่หาความรู้ สติปัญญาแตกฉาน ความยุติธรรม หมายถึงผู้ใหญ่ ผู้ปกครอง ครูอาจารย์ ผู้พิพากษา บิดา มารดา ความสุขุมเยือกเย็น',
        rate: 'great',
    },
    {
        number: 6,
        meaning:
            'หมายถึง ดาวศุกร์ เป็นดาวศิลปะ ดาวแห่งความรัก ดาวแห่งชีวิตสมรส บุคคลเลข 6 มีเสน่ห์ดึงดูดผู้อื่นอย่างรุนแรง รักสวยรักงาม มีรสนิยมแต่งตัว ชอบศิลปะ ดนตรี มองโลกในแง่ดี มีรสนิยมดี ชอบสิ่งประณีต อารมณ์อ่อนไหวง่าย เป็นดาวแห่งความสมดุล คู่มิตรกับเลข 3',
        rate: 'great',
    },
    {
        number: 7,
        meaning:
            'หมายถึง ดาวเสาร์ เป็นดาวประธานฝ่ายบาปเคราะห์ หมายถึงอำนาจแห่งทุกข์โทษ ความล่าช้า โรคภัยไข้เจ็บ วินาศ ระทมทุกข์ การสูญเสีย คนชั้นต่ำ สลัม ความยากจน หวาดระแวง ความอิจฉา บุคคลเลข 7 มักอดทน สติดีเลิศ ชอบอยู่ง่ายๆ แต่ชีวิตมักขัดสน สถานที่เลข 7 คือย่านสลัม สิ่งสกปรก',
        rate: 'bad',
    },
    {
        number: 8,
        meaning:
            'หมายถึง ดาวราหู เป็นดาวคราสร้าย รองจากดาวเสาร์ ให้โทษ เลข 8 คือความลุ่มหลง มัวเมา โมหะจริต ถูกใส่ร้ายป้ายสี มักถูกกลั่นแกล้ง มีคนแอบอ้างทำให้เสียชื่อ มักเป็นคนใจร้อน มักมีปัญหาด้านชีวิตสมรส ชีวิตมักไม่แน่นอน ขึ้นๆ ลงๆ',
        rate: 'bad',
    },
    {
        number: 9,
        meaning:
            'หมายถึง ดาวเกตุ เป็นเลขอำนาจ ความสำเร็จ เป็นเลขดี เลขศักดิ์สิทธิ์ ส่งเสริมให้มีอำนาจวาสนา บารมี ชื่อเสียง บริวารมาก มักตกน้ำไม่ไหลตกไฟไม่ไหม้ แคล้วคลาดเป็นเลขโชคดี ชีวิตเต็มไปด้วยการเดินทาง การเปลี่ยนแปลง สนใจของเก่าโบราณ นักโบราณดีเยี่ยม ชอบวิชาการด้านประวัติศาสตร์',
        rate: 'great',
    },

    {
        number: 10,
        meaning:
            'ใครพัวพันกับเลขนี้มีความมั่นใจในตนเองสูง มีความทะเยอทะยานดี ชอบของแปลกใหม่ โดยไม่ซ้ําแบบใคร เพราะเลข 10 อยู่รว่ มกัน เป็นคนถือเกียรติ ไม่อยู่ใต้บังคับใคร ชอบทําอะไรแหวกแนวไม่ มีใครเหมอื น เป็นคนไม่นิ่มนวล มอี ารมณ์ค่อนข้างแข็งกรา้ ว แต่เป็นคนกล้าได้กล้าเสีย กล้าตัดสินใจ โดยไม่หวั่นต่ออุปสรรคที่ขวางหน้า บุคคลเลข 10 มักมีอุปสรรคในชีวิต เพราะว่าเลข 10 คือเลข 1 กับ 0 ไม่ถูกกัน ดาวศตั รูอยู่ด้วยกนั จึงทําให้มอี ุปสรรค ทาํ งานมักพบคู่แข่งปองร้าย บริวารมักให้โทษ เป็นคนชอบ เผด็จการ บุคคลเลข 10 มักเป็นคนอาภัพ มศี ตั รูรอบด้าน บริวารในครอบครัวแข็งข้อ กอ่ เหตุกระทบกระเทือนใจอยา่ งรุนแรง',
        rate: 'poor',
    },
    {
        number: 11,
        meaning:
            'หมายถงึ เลข 1 สองตัวอยรู่ ว่ มกัน บุคคลเลข 11 มักอ่อนนอกแข็งใน การแสดงออกภาพนอกเป็นคนนมุ่ นวล เป็นคน ซ่อนบุคลกิ อันแทจ้ ริง ซงึ่ เป็นคนอ่านใจยาก มกั อําพรางส่วนลึกไม่ให้ใครเห็น ยาก ทายใจได้ บุคคล 11 ทําเป็นคนสองคน หรอื คนสองรา่ ง ทําอะไรชอบถือตัวเป็น หลัก และอวดอ้างตัวเองให้คนอื่นไม่พอใจ อทิ ธิพลเลข 11 ทําอะไรชอบเขา้ ข้าง ตัวเอง มกั ถอื พวกพ้อง เป็นคนดื้อรั้นอย่างมาก ลองปักใจอะไรแล้ว ยากที่ใครจะ เปลี่ยนใจได้ง่าย คอื บางครั้ง บุคคลเลข 11 อ่อนไหวง่าย 1 บวก 1 เท่ากับ 2 ดาวจันทร์ ทาํ ให้จิตใจรวนเรไม่แน่นอน มกั จะถูกคนหมมู่ ากลากไป ชวี ิตต้องสร้าง ด้วยลําแข้งของตัวเอง ฟันฝ่าอุปสรรคอยา่ งโดดเดี่ยว เลข 11 ไม่ชอบให้ใครมา ลองดีหรือมาลูบคม ใครมาข่มขู่แล้วมกั จะเจอดี ถ้าสู้ทางตรงไม่ได้มักอาฆาต จะหาทางล้างแค้นภายหลัง บุคคลเลข 11 มีความทะเยอทะยานสูง ใฝ่ฝัน ความก้าวหนา้ เร่าร้อนอย่างรุนแรง เมอื่ ตัดสินแล้วมกั แสดงความเด็ดเดี่ยวแข็งกร้าว ในเหตุการณ์ร้ายแรงอยา่ งเด็ดขาด โดยไม่มีใครคิดฝันมากอ่ น',
        rate: 'poor',
    },
    {
        number: 12,
        meaning:
            'เป็นธาตุ ไฟบวกธาตุน้ําอยู่ร่วมกนั เลข12มีอารมณ์ขัดแย้งและมีอาการหยิ่งถือดีมีดาว อาทิตยค์ ือ 1 ธาตุไฟรวมอยู่ด้วย แต่ขณะเดียวกันเป็นคนอ่อนไหวง่าย เพราะ อิทธิพลของดาวจันทร์ ธาตุน้ํา ทาํ ให้เชื่อใจคนงา่ ย มกั ถกู ยยุ งได้ง่าย เลข 1 บวก 2 เท่ากับดาวอังคาร 3 ทําให้เป็นคนกล้าแข็ง ชอบเอาชนะ ไม่ยอมสยบให้ใครง่าย ๆ ด้วยอิทธิพลของเลข 3 ทําให้ชีวิตเกิดอุบัติเหตุง่าย มีโรคภัยไข้เจ็บเบียดเบียน เรื้อรัง เลข 12 เป็นคําสั่งของดาวราหู จึงส่งเสริมให้คนเลข 12 เป็นคนหูเบา เชื่อ คนง่ายโดยไม่ไตร่ตรองให้รอบคอบ มกั ชอบทําอะไรบุ่มบ่ามด้วยความเข้าใจผิด จึง ถูกคนอื่นยยุ งปั่นหัวได้ง่าย เลข 12 ต้องระวัง ถา้ หลงใคร มกั จะหลงไม่ลืมหูลืมตา กล้าเสยี สละแม้กระทั่งชวี ิตตัวเองเพื่อคนอื่น เลข 12 หากอยู่ในตําแหน่งงานที่สงู ต้องระวังชีวิตมกั จะขึ้นลง หาความแน่นอนไมค่ ่อยได้ มกั จะถกู ใสร่ ้ายป้ายสจี ากคน อื่นเสมอ',
        rate: 'poor',
    },
    {
        number: 13,
        meaning:
            'ประกอบด้วย 1 บวกกับ 3 ดาวคู่ศัตรู อยู่ร่วมกัน เกิดทั้งเรื่องดีและเรอื่ งรา้ ยอย่างฉบั พลัน หมายถึงดาวอบุ ัติเหตุแบบ รวดเร็วและรุนแรง ให้ทงั้ คุณและโทษ ดีใจหาย แต่แย่ มักเปลี่ยนแปลงเร็ว เลข 13 ดีและรา้ยดกี็มกัส่งผลดีอย่างรวดเร็วไมค่าดคิดมาก่อน ขณะเดียวกันมีเหตุร้าย เกิดขึ้นไม่คาดฝันเช่นเดยี วกัน แปลกไม่เหมือนคนอื่น เป็นไปอย่างแปลกแหวกแนว ไม่เหมือนใคร กลา้ แบบไม่กลัวใคร ย่อมเกิดเหตุในบั้นปลาย เลข 1 กับ 3 อยู่ รวมกันไม่ดี คศู่ ัตรกู ันทําให้เกิดอุบัติเหตุ ผ่าตดั รถคว่ํา ถกู อาวุธ ถูกศัตรูทําร้าย ครอบครัวมีปัญหาแตกร้าว ไม่ปกติสุข ผู้ใหญ่ให้โทษ มีเรื่องชสู้ าว และสายตามกั มี ปัญหา',
        rate: 'poor',
    },
    {
        number: 14,
        meaning:
            'คือดาวอาทิตย์บวกดาวพุธ เลขคู่นี้มัก ส่งเสรมิ ให้ชีวิตพบกับความรุ่งโรจน์อย่างมั่นคง เลข 1 ธาตุไฟ เลข 4 ธาตุดิน ทําให้ ไฟไม่ขาดเชื้อ เพราะมดี ินคอยช่วยสนับสนุน บุคคลเลข 14 มีมันสมองเฉียบแหลม ว่องไว ชอบคิด ชอบคน้ คว้าจดจาํ สิ่งต่าง ๆ ได้อย่างแม่นจาํ เลข 14 เป็นเลขดาว จักรพรรดิ ตามหลกั พรหมชาติมักมีกาํ ลังเข้มแข็ง กลา้ แข็งส่งเสริมให้พบกบั ความสําเร็จอยา่ งดีเยยี่ ม เลข 14 บวกกันได้ 5 ได้ดาวพฤหัสบดี ทําให้เป็นคนมี ความคิดสุขุมรอบคอบ เป็นคนชอบศึกษาค้นควา้ มีความยุติธรรมเป็นหลักประจาํ ใจ',
        rate: 'great',
    },
    {
        number: 15,
        meaning:
            'คือมกั เป็นคนมีเสน่ห์ ปฏิภาณว่องไว เข้าได้กับคนทุกระดับ อ่านใจเก่ง เลข 15 เป็นเลขกาํ ลังดาวจันทร์ จงึ มักมผี ู้ใหญ่ ค้ําจุนตลอดเวลา มกั ได้รับของตอบแทน ทั้งสิ่งของและการเงินจากบุคคลอื่นเสมอ เลข 15 จุดอ่อนมักเป็นคนขี้สงสารคนอื่น จึงทาํ ให้ถูกหลอกง่ายจึงต้องระวังการหู เบา อย่าเชื่อใจใครงา่ ย ๆ โดยไม่ไตร่ตรอง บุคคลเลข 15 เป็นนักพูดขั้นดี มี ความดึงดูดเรา้ ใจคน บุคคลเลข 15 จึงเหมาะกบั อาชีพนักการปกครอง นักบริหาร เลข 15 บอกกันได้ 6 ดาวศุกร์ จึงทําให้มีแนวโน้มไปในทางศิลปะ มีรสนยิ มทาง ศิลปะ รักสวยรักงาม ชอบความรื่นรมย์ เป็นคนมีพรสวรรค์ มกั เป็นคนมองโลกใน แง่ดีเสมอ เป็นคนไม่ชอบเก็บตัว ไม่ชอบทุกข์ เป็นคนมีเสน่ห์แบบตรงไปตรงมา',
        rate: 'great',
    },
    {
        number: 16,
        meaning:
            'หมายถึงเลขดาวราหู เลข 1 ดาวอาทิตย์ เลข 6 ดาวศุกร์ เลข 16 อยู่รวมกันเป็นคนสองจิตสองใจรวนเร อิทธิพลเลข 16 เป็นคนเจ้าอารมณ์ และมักหลงผิดง่าย คนเลข 16 มักอ่อนนอกแข็งใน เข้มแข็งเอาจริงเอาจัง คนเลข 16 เป็นคนเชื่อมั่นในตัวเองสูงและหัวดื้อ เลข 16 คือเลขแห่งโชคดีและโชคร้าย คละเคล้ากันไป เป็นเลขแห่งการขึ้นๆ ลงๆ ของชีวิต มีทั้งดีและไม่ดีสลับกันไป',
        rate: 'poor',
    },
    {
        number: 17,
        meaning:
            'คือ เลขดาวเสาร์และดาวอาทิตย์อยู่ร่วมกัน บุคคลเลข 17 มักเป็นคนแข็งนอกอ่อนใน เป็นคนอมทุกข์ แต่มีความจริงจังในชีวิต เป็นคนหยิ่งในศักดิ์ศรีของตัวเอง เลข 17 ตามหลักโหราศาสตร์นั้นเป็นเลขอับโชค เลข 17 อยู่รวมกันมีเลข 1 ดวงอาทิตย์ กับเลข 7 ดาวเสาร์ ทําให้ส่งผลในทางอุบัติเหตุ ผ่าตัด เจ็บตัวโดยใช่เหตุ มีเลขนี้จะพบกับอุปสรรคในการดําเนินชีวิต เลข 17 บวกกันได้ 8 ราหู ชีวิตไม่แน่นอน เปลี่ยนแปลงขึ้นลง ขึ้นสูงสุดแล้วตกต่ำสุดโดยไม่คาดคิด',
        rate: 'poor',
    },
    {
        number: 18,
        meaning:
            'หมายถึงเลขดาวอาทิตย์และดาวราหู เลข 1 กับเลข 8 อยู่รวมกันเป็นดาวคู่ศัตรู จึงให้ทั้งคุณและโทษแปลกแยกไม่เหมือนใคร เลข 18 เป็นเลขอาถรรพณ์ทําให้ชีวิตค่อนข้างผันผวนเปลี่ยนแปลงขึ้นๆ ลงๆ ตามอิทธิพลเลข 18 เลข 1 ดาวอาทิตย์ บวกเลข 8 ราหู แสดงถึงความขัดแย้งในตัวเอง ทําให้ชีวิตลุ่มๆ ดอนๆ ดาวคู่ศัตรูอยู่ร่วมกันจะมีความอัปมงคลในชีวิต มีเลข 18 ต้องระวังเรื่องอุบัติเหตุ การเจ็บไข้ได้ป่วย เลข 18 จึงถือเป็นเลขเสีย',
        rate: 'poor',
    },
    {
        number: 19,
        meaning:
            'หมายถึงดาวอาทิตย์กับดาวเกตุ ดาวอาทิตย์มีดาวเกตุประกบอยู่ ทําให้เกิดความสำเร็จอย่างงดงาม บุคคลเลข 19 เป็นคนมีความรู้ความสามารถ เฉลียวฉลาด มีความรอบรู้และมีความคิดสุขุมลุ่มลึก เป็นคนชอบช่วยเหลือผู้อื่น ชีวิตรุ่งโรจน์อย่างดีเยี่ยม เลข 19 ถือว่าเป็นเลขดีมาก เพราะเลข 1 อาทิตย์บวก 9 เกตุ เป็นดาวคู่มิตรกัน ช่วยส่งเสริมให้ชีวิตประสบความสำเร็จ',
        rate: 'great',
    },
    {
        number: 20,
        meaning:
            'หมายถึงดาวจันทร์และดาวเกตุ เลข 2 บวกกับ 0 ดาวจันทร์กับเกตุทําให้ชีวิตมีความเปลี่ยนแปลงแบบไม่แน่นอน ชีวิตคนเลข 20 จึงมีความไม่แน่นอน บางทีมีความสุขอย่างที่สุด แต่บางครั้งก็ห่อเหี่ยวผิดหวังอย่างแรง เลข 20 ต้องอาศัยความพยายามอย่างหนัก ต้องสร้างด้วยตัวเอง ฟันฝ่าอุปสรรคด้วยตัวเอง',
        rate: 'poor',
    },
    {
        number: 21,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวอาทิตย์ ดาวคู่นี้เป็นดาวคู่มิตรจึงช่วยส่งเสริมให้ชีวิตดีงาม เลข 21 รวมกันเป็นเลข 3 คือดาวอังคาร จึงทําให้ชีวิตเป็นคนเข้มแข็งอดทนทนต่อสู้ไม่ย่อท้อต่ออุปสรรค ชีวิตจึงประสบความสําเร็จดี',
        rate: 'great',
    },
    {
        number: 22,
        meaning:
            'หมายถึงดาวจันทร์อยู่ร่วมกับดาวจันทร์ เลข 2 สองตัวอยู่ร่วมกัน เลข 22 หมายถึงความอ่อนหวาน โรแมนติก จิตใจอ่อนไหวง่าย บุคคลเลข 22 เป็นคนใจดีมีเมตตาเห็นใจผู้อื่นดีมาก เป็นคนชอบช่วยเหลือสงเคราะห์คนอื่น ชีวิตที่มีความไม่แน่นอน มักจะขึ้นๆ ลงๆ ชีวิตคู่ไม่ดี มักจะขัดแย้งข่มเหงกัน',
        rate: 'poor',
    },
    {
        number: 23,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวอังคาร เลขนี้เป็นเลขคู่มิตร ช่วยส่งเสริมให้ชีวิตพบความสุขและความสําเร็จอย่างงดงาม เลข 23 จึงทําให้ชีวิตเป็นสุข ความรักดี แต่ต้องระวังความไม่แน่นอนแปรปรวนของเลข 23 จะทําให้ชีวิตมักมีการเปลี่ยนแปลงอย่างรวดเร็ว อารมณ์แปรปรวนขึ้นๆ ลงๆ ไม่แน่นอน',
        rate: 'great',
    },
    {
        number: 24,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวพุธ เลขนี้เป็นเลขที่ดีมากตามหลักโหราศาสตร์ เลข 24 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดีเยี่ยม เป็นคนมีเสน่ห์ ชอบสร้างความพอใจให้คนอื่น การเจรจาดีเยี่ยม เป็นคนมีศิลปะดีงาม เลขนี้ให้คุณมากกว่าให้โทษ',
        rate: 'great',
    },
    {
        number: 25,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวพฤหัสบดี เลขนี้เป็นเลขดีตามหลักโหราศาสตร์ เลข 25 เป็นเลขดีจึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดีเยี่ยม ชีวิตพบแต่ความเจริญรุ่งเรือง เลข 25 เป็นเลข 7 ดาวเสาร์จึงต้องระวังความเคร่งเครียดมากเกินไปทําให้สุขภาพเสียได้',
        rate: 'great',
    },
    {
        number: 26,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวศุกร์ เลขนี้เป็นเลขที่ดี เลข 26 เป็นเลขดีตามหลักโหราศาสตร์ ช่วยส่งเสริมให้ชีวิตพบกับความสุขความสําเร็จอย่างดีเยี่ยม มีโชคลาภไม่ขาด แต่ต้องระวังจะหูเบาเชื่อคนง่ายเกินไป',
        rate: 'great',
    },
    {
        number: 27,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวเสาร์ เลขนี้มีดาวเสาร์บวกดาวจันทร์ไม่เป็นผลดีมากนัก เลข 27 เป็นเลขร้าย จึงทําให้ชีวิตมีอุปสรรคความยุ่งยาก ความผิดหวังอย่างแรง มีความไม่แน่นอน เลข 27 ถือว่าเป็นเลขไม่ดี',
        rate: 'poor',
    },
    {
        number: 28,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวราหู เลขนี้มีดาวราหูบวกดาวจันทร์ไม่เป็นผลดีนัก จึงทําให้ชีวิตพบกับความผันผวนแบบไม่แน่นอน เลข 28 เป็นเลขร้าย ชีวิตที่มีความไม่แน่นอน',
        rate: 'poor',
    },
    {
        number: 29,
        meaning:
            'หมายถึงดาวจันทร์บวกดาวเกตุ เลขนี้มีดาวเกตุและดาวจันทร์บวกกัน เป็นเลขคู่มิตร จึงทําให้ชีวิตมีความสุข มีความสำเร็จดี แต่มักมีการเปลี่ยนแปลงบ่อย ชีวิตมักไม่แน่นอน',
        rate: 'great',
    },
    {
        number: 30,
        meaning:
            'หมายถึงดาวอังคารบวกดาวเกตุ เลขนี้มีดาวอังคารและดาวเกตุเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 30 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก ความผิดหวัง',
        rate: 'poor',
    },
    {
        number: 31,
        meaning:
            'หมายถึงดาวอังคารบวกดาวอาทิตย์ เลขนี้เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตพบกับความสุขและความสําเร็จดี เลข 31 จึงเป็นเลขดี ช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 32,
        meaning:
            'หมายถึงดาวอังคารบวกดาวจันทร์ เลขนี้เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีอุปสรรคความยุ่งยาก ความผิดหวัง ชีวิตที่มีความไม่แน่นอน',
        rate: 'poor',
    },
    {
        number: 33,
        meaning:
            'หมายถึงดาวอังคารบวกดาวอังคาร เลขนี้มีดาวอังคารบวกดาวอังคารเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 33 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 34,
        meaning:
            'หมายถึงดาวอังคารบวกดาวพุธ เลขนี้เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตพบกับความสุขและความสําเร็จดี เลข 34 จึงเป็นเลขดี ช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 35,
        meaning:
            'หมายถึงดาวอังคารบวกดาวพฤหัสบดี เลขนี้เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตพบกับความสุขและความสําเร็จดี เลข 35 จึงเป็นเลขดี ช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 36,
        meaning:
            'หมายถึงดาวอังคารบวกดาวศุกร์ เลขนี้เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตพบกับความสุขและความสําเร็จดี เลข 36 จึงเป็นเลขดี ช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 37,
        meaning:
            'หมายถึงดาวอังคารบวกดาวเสาร์ เลขนี้มีดาวอังคารและดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 37 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 38,
        meaning:
            'หมายถึงดาวอังคารบวกดาวราหู เลขนี้มีดาวอังคารและดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 38 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 39,
        meaning:
            'หมายถึงดาวอังคารบวกดาวเกตุ เลขนี้มีดาวอังคารและดาวเกตุเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 39 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 40,
        meaning:
            'หมายถึงดาวพุธบวกดาวเกตุ เลขนี้มีดาวพุธและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 40 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 41,
        meaning:
            'หมายถึงดาวพุธบวกดาวอาทิตย์ เลขนี้มีดาวพุธและดาวอาทิตย์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 41 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 42,
        meaning:
            'หมายถึงดาวพุธบวกดาวจันทร์ เลขนี้มีดาวพุธและดาวจันทร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 42 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 43,
        meaning:
            'หมายถึงดาวพุธบวกดาวอังคาร เลขนี้มีดาวพุธและดาวอังคารเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 43 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 44,
        meaning:
            'หมายถึงดาวพุธบวกดาวพุธ เลขนี้มีดาวพุธและดาวพุธเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 44 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 45,
        meaning:
            'หมายถึงดาวพุธบวกดาวพฤหัสบดี เลขนี้มีดาวพุธและดาวพฤหัสบดีเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 45 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 46,
        meaning:
            'หมายถึงดาวพุธบวกดาวศุกร์ เลขนี้มีดาวพุธและดาวศุกร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 46 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 47,
        meaning:
            'หมายถึงดาวพุธบวกดาวเสาร์ เลขนี้มีดาวพุธและดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 47 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 48,
        meaning:
            'หมายถึงดาวพุธบวกดาวราหู เลขนี้มีดาวพุธและดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 48 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 49,
        meaning:
            'หมายถึงดาวพุธบวกดาวเกตุ เลขนี้มีดาวพุธและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 49 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 50,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวเกตุ เลขนี้มีดาวพฤหัสบดีและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 50 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 51,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวอาทิตย์ เลขนี้มีดาวพฤหัสบดีและดาวอาทิตย์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 51 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 52,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวจันทร์ เลขนี้มีดาวพฤหัสบดีและดาวจันทร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 52 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 53,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวอังคาร เลขนี้มีดาวพฤหัสบดีและดาวอังคารเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 53 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 54,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวพุธ เลขนี้มีดาวพฤหัสบดีและดาวพุธเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 54 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 55,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวพฤหัสบดี เลขนี้มีดาวพฤหัสบดีและดาวพฤหัสบดีเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 55 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 56,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวศุกร์ เลขนี้มีดาวพฤหัสบดีและดาวศุกร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 56 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 57,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวเสาร์ เลขนี้มีดาวพฤหัสบดีและดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 57 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 58,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวราหู เลขนี้มีดาวพฤหัสบดีและดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 58 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 59,
        meaning:
            'หมายถึงดาวพฤหัสบดีบวกดาวเกตุ เลขนี้มีดาวพฤหัสบดีและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 59 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 60,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวเกตุ เลขนี้มีดาวศุกร์และดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 60 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 61,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวอาทิตย์ เลขนี้มีดาวศุกร์และดาวอาทิตย์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 61 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 62,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวจันทร์ เลขนี้มีดาวศุกร์และดาวจันทร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 62 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 63,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวอังคาร เลขนี้มีดาวศุกร์และดาวอังคารเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 63 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 64,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวพุธ เลขนี้มีดาวศุกร์และดาวพุธเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 64 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 65,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวพฤหัสบดี เลขนี้มีดาวศุกร์และดาวพฤหัสบดีเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 65 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 66,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวศุกร์ เลขนี้มีดาวศุกร์และดาวศุกร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 66 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 67,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวเสาร์ เลขนี้มีดาวศุกร์และดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 67 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 68,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวราหู เลขนี้มีดาวศุกร์และดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 68 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 69,
        meaning:
            'หมายถึงดาวศุกร์บวกดาวเกตุ เลขนี้มีดาวศุกร์และดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 69 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 70,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวเกตุ เลขนี้มีดาวเสาร์และดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 70 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 71,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวอาทิตย์ เลขนี้มีดาวเสาร์และดาวอาทิตย์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 71 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 72,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวจันทร์ เลขนี้มีดาวเสาร์และดาวจันทร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 72 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 73,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวอังคาร เลขนี้มีดาวเสาร์และดาวอังคารเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 73 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 74,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวพุธ เลขนี้มีดาวเสาร์และดาวพุธเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 74 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 75,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวพฤหัสบดี เลขนี้มีดาวเสาร์และดาวพฤหัสบดีเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 75 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 76,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวศุกร์ เลขนี้มีดาวเสาร์และดาวศุกร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 76 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 77,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวเสาร์ เลขนี้มีดาวเสาร์และดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 77 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 78,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวราหู เลขนี้มีดาวเสาร์และดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 78 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 79,
        meaning:
            'หมายถึงดาวเสาร์บวกดาวเกตุ เลขนี้มีดาวเสาร์และดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 79 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 80,
        meaning:
            'หมายถึงดาวราหูบวกดาวเกตุ เลขนี้มีดาวราหูและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 80 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 81,
        meaning:
            'หมายถึงดาวราหูบวกดาวอาทิตย์ เลขนี้มีดาวราหูและดาวอาทิตย์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 81 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 82,
        meaning:
            'หมายถึงดาวราหูบวกดาวจันทร์ เลขนี้มีดาวราหูและดาวจันทร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 82 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 83,
        meaning:
            'หมายถึงดาวราหูบวกดาวอังคาร เลขนี้มีดาวราหูและดาวอังคารเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 83 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 84,
        meaning:
            'หมายถึงดาวราหูบวกดาวพุธ เลขนี้มีดาวราหูและดาวพุธเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 84 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 85,
        meaning:
            'หมายถึงดาวราหูบวกดาวพฤหัสบดี เลขนี้มีดาวราหูและดาวพฤหัสบดีเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 85 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 86,
        meaning:
            'หมายถึงดาวราหูบวกดาวศุกร์ เลขนี้มีดาวราหูและดาวศุกร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 86 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 87,
        meaning:
            'หมายถึงดาวราหูบวกดาวเสาร์ เลขนี้มีดาวราหูและดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 87 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 88,
        meaning:
            'หมายถึงดาวราหูบวกดาวราหู เลขนี้มีดาวราหูและดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 88 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 89,
        meaning:
            'หมายถึงดาวราหูบวกดาวเกตุ เลขนี้มีดาวราหูและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 89 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 90,
        meaning:
            'หมายถึงดาวเกตุบวกดาวเกตุ เลขนี้มีดาวเกตุและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 90 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 91,
        meaning:
            'หมายถึงดาวเกตุบวกดาวอาทิตย์ เลขนี้มีดาวเกตุและดาวอาทิตย์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 91 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 92,
        meaning:
            'หมายถึงดาวเกตุบวกดาวจันทร์ เลขนี้มีดาวเกตุและดาวจันทร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 92 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 93,
        meaning:
            'หมายถึงดาวเกตุบวกดาวอังคาร เลขนี้มีดาวเกตุและดาวอังคารเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 93 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 94,
        meaning:
            'หมายถึงดาวเกตุบวกดาวพุธ เลขนี้มีดาวเกตุและดาวพุธเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 94 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 95,
        meaning:
            'หมายถึงดาวเกตุบวกดาวพฤหัสบดี เลขนี้มีดาวเกตุและดาวพฤหัสบดีเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 95 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 96,
        meaning:
            'หมายถึงดาวเกตุบวกดาวศุกร์ เลขนี้มีดาวเกตุและดาวศุกร์เป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 96 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 97,
        meaning:
            'หมายถึงดาวเกตุบวกดาวเสาร์ เลขนี้มีดาวเกตุและดาวเสาร์เป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 97 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 98,
        meaning:
            'หมายถึงดาวเกตุบวกดาวราหู เลขนี้มีดาวเกตุและดาวราหูเป็นเลขคู่ศัตรู จึงทําให้ชีวิตมีความผันผวนแบบไม่แน่นอน เลข 98 จึงเป็นเลขร้าย ทําให้ชีวิตมีอุปสรรคความยุ่งยาก',
        rate: 'poor',
    },
    {
        number: 99,
        meaning:
            'หมายถึงดาวเกตุบวกดาวเกตุ เลขนี้มีดาวเกตุและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 99 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
    {
        number: 100,
        meaning:
            'หมายถึงดาวเกตุบวกดาวเกตุ เลขนี้มีดาวเกตุและดาวเกตุเป็นเลขคู่มิตร จึงช่วยส่งเสริมให้ชีวิตประสบความสําเร็จดี เลข 100 จึงเป็นเลขดีช่วยส่งเสริมให้ชีวิตประสบความสําเร็จ',
        rate: 'great',
    },
];
