export const wishes = [
    {
        id: 1,
        title: 'ปีใหม่',
        note: 'ขอให้สิ่งที่ดีที่สุดในปีที่กำลังมาถึงนี้ ดียิ่งกว่าเรื่องที่ดีที่สุดของปีที่ผ่านมา และขอให้เป็นปีที่ดียิ่ง ๆ ขึ้นไป สวัสดีปีใหม่ %YEAR%',
        type: ['📅'],
    },
    {
        id: 2,
        note: 'ปีใหม่ %YEAR% เป็นช่วงเวลาที่ดีที่สุดในการเริ่มต้นใหม่ ขอให้%NAME%มีความสุขมาก ๆ ประสบผลสำเร็จในหน้าที่การงาน เจริญๆยิ่งขึ้นไปนะ',
        type: ['📅'],
    },
    {
        id: 3,
        note: 'Happy New Year %YEAR%, wish you all the best rich healthy There are only good things in life throughout the year',
        type: ['📅', '🙏'],
    },
    {
        id: 4,
        note: 'ขอคุณพระรัตนตรัยคุ้มครองท่าน ดลบันดาลให้มีแต่ความสุขเกษมศรี คิดสิ่งใดตรงตามหวังไร้ราคี มีแต่เรื่องดี ๆ ตลอดปีใหม่เทอญ',
        type: ['📅', '🙏'],
    },
    {
        id: 5,
        note: 'ในอภิลักขิตสมัยขึ้นปีใหม่ ขออำนาจคุณพระศรีรัตนตรัย และสิ่งศักดิ์สิทธิ์ทั้งหลาย โปรดดลบันดาลให้ท่านและเจ้าหน้าที่ จงประสบแต่ความสุข ความสำเร็จ สมบูรณ์ พูลลาภ ในสิ่งอันพึงปรารถนา ตลอดไป',
        type: ['📅', '🙏'],
    },
    {
        id: 6,
        note: 'ปีใหม่นี้ขอให้เปิดใจรับสิ่งใหม่ ๆ และทิ้งทั้งเรื่องไม่ดี คนไม่ดี ไว้ข้างหลัง อะไรที่พลาดพลั้ง ปล่อยมันไป',
        type: ['📅'],
    },
    {
        id: 7,
        note: 'ขอให้%NAME%มีความสุขมาก ๆ ปีใหม่ขอให้พบแต่สิ่งดี ๆ สิ่งที่ร้าย ๆ ขอให้หายไปให้หมดเลย',
        type: ['📅'],
    },
    {
        id: 8,
        note: 'ขอให้ปีใหม่นี้%NAME% ได้รับความสุข ความเจริญรุ่งเรือง และความสำเร็จในทุกด้านของชีวิต',
        type: ['📅', '🙏'],
    },
    {
        id: 9,
        note: 'สวัสดีปีใหม่ %YEAR% ขอให้คุณ%NAME%และครอบครัวที่น่ารัก มีแต่ความสุขและความเจริญรุ่งเรืองในวันปีใหม่ที่จะถึงนี้',
        type: ['📅', '🙏'],
        title: 'ทางการ',
    },
    {
        id: 10,
        note: 'ปีใหม่นี้ขอให้%NAME% ได้รับสิ่งดีๆ เข้ามาในชีวิต ทั้งในด้านสุขภาพ ความรัก และการงาน',
        type: ['📅'],
    },
    {
        id: 11,
        note: 'สุขสันต์วันเกิด%NAME% ขอให้วันนี้เป็นวันที่เต็มไปด้วยความสุข สนุกสนาน และช่วงเวลาที่ดีๆ กับคนที่คุณรัก',
        type: ['🍰'],
    },
    {
        id: 12,
        note: '🎉🎂🎀💗🥳สุขสันต์วันเกิด%NAME% ขอให้มีสุขภาพแข็งแรง มีความสุขทุกวัน และประสบความสำเร็จในทุกเรื่องที่ทำ🎂🥳🎉🎊',
        type: ['🍰'],
    },
    {
        id: 13,
        note: 'สุขสันต์วันเกิด%NAME% ขอให้มีชีวิตที่ราบรื่น เจอแต่เรื่องดีๆ และมีความสุขมากมายในปีนี้',
        type: ['🍰'],
    },
    {
        id: 14,
        note: 'สุขสันต์วันเกิด%NAME% ขอให้ทุกสิ่งที่ฝันเป็นจริง และมีชีวิตที่เปี่ยมไปด้วยความสุข',
        type: ['🍰'],
    },
];
